In [7]:
import pandas as pd
df = pd.read_csv('data.csv')

#fetch first 5 rows:
df.head(5)
#fetch last 5 rows:
df.tail(5)
#statistical analysis:
df.describe()
#data types:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [11]:
''' HANDLING MISSING VALUES:'''
df.isnull() #true means missing values are there
df.isnull().any(axis = 1)
df.isnull().any() #default axis 0
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [13]:
#filling missing values:
# df.fillna(0)

In [17]:
#filling missing values with mean:
df['sales_fillNaN'] = df['Sales'].fillna(df['Sales'].mean())
# df

In [25]:
#changing data type:
df.dtypes
# df['Value_new'] = df['Value'].astype(int) gives error becoz it has some missing values
df['Value_new'] = df['Value'].fillna(df['Value'].mean()).astype(int)
df.head(3)

,Sales Date,Category,Value,Product,Sales,Region,sales_fillNaN,Value_new
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32

In [26]:
'''Renaming columns'''
df = df.rename(columns={'Date' : 'Sales Date'})
df.head(3)

,Sales Date,Category,Value,Product,Sales,Region,sales_fillNaN,Value_new
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32

In [31]:
# APLLYING FUNCTION TO COLUMNS:
df['New_values'] = df['Value'].apply(lambda x : x*2)
df.head(3)

,Sales Date,Category,Value,Product,Sales,Region,sales_fillNaN,Value_new,New_values
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64.0